<?php
/**
 * @author Rahim Süleymanov
 * @email rahim.suleymanov94@gmail.com
 * Date: 19.07.2023
 * Time: 21:41
 */

function letter_converter(string $text) : string
{
    $letters = [
        'a'=>'a',
        'A'=>'А',
        'b'=>'б',
        'B'=>'Б',
        'v'=>'в',
        'V'=>'В',
        'q'=>'г',
        'Q'=>'Г',
        'd'=>'д',
        'D'=>'Д',
        'e'=>'з',
        'E'=>'З',
        'j'=>'ж',
        'J'=>'Ж',
        'Z'=>'З',
        'z'=>'з',
        'İ'=>'И',
        'i'=>'и',
        'Y'=>'Й',
        'y'=>'й',
        'K'=>'K',
        'k'=>'k',
        'L'=>'Л',
        'l'=>'л',
        'M'=>'М',
        'm'=>'м',
        'N'=>'Н',
        'n'=>'н',
        'O'=>'O',
        'o'=>'o',
        'P'=>'П',
        'p'=>'п',
        'R'=>'Р',
        'r'=>'р',
        'S'=>'С',
        's'=>'с',
        'T'=>'Т',
        't'=>'т',
        'U'=>'У',
        'u'=>'у',
        'F'=>'Ф',
        'f'=>'ф',
        'H'=>'Х',
        'h'=>'х',
        'Ç'=>'Ч',
        'ç'=>'ч',
        'Ş'=>'Ш',
        'ş'=>'ш',
        'I'=>'Ы',
        'ı'=>'ы',
        ''=>'Е',
        ''=>'е',
        ''=>'Ц',
        ''=>'ц',
        ''=>'Щ',
        ''=>'щ',
        ''=>'Ъ',
        ''=>'ъ',
        ''=>'Ь',
        ''=>'ь',
        'Ü'=>'Ю',
        'ü'=>'ю',
        ''=>'Я',
        ''=>'я',
        'Ə'=>'А',
        'ə'=>'а'
    ];



    return str_replace(array_keys($letters), array_values($letters), $text);
}
 